---
order: 2
title: Задание 2. Сортировка диапазона
---

## Теория

Стандартная сортировка пузырьком работает со всем массивом целиком. Однако иногда возникает необходимость отсортировать только определенную часть массива, оставив остальные элементы на своих местах.

Для этого нужно модифицировать алгоритм так, чтобы:

-  Сравнивались и обменивались только элементы в заданном диапазоне `[left, right]`

-  Элементы за пределами этого диапазона оставались нетронутыми

-  Алгоритм корректно обрабатывал граничные условия

## Пример неоптимизированной реализации

```csharp
public static void BubbleSortRange(int[] array, int left, int right)
{
    for (int i = 0; i < array.Length; i++)
        for (int j = 0; j < array.Length - 1; j++)
            if (array[j] > array[j + 1])
            {
                var t = array[j + 1];
                array[j + 1] = array[j];
                array[j] = t;
            }
}
```

## Задание

Доработайте алгоритм сортировки пузырьком так, чтобы он сортировал только указанный диапазон `[left, right]`, а элементы за этим диапазоном оставлял на своих местах.

**Пример:**

-  `BubbleSortRange(new[] {4, 3, 2, 1}, 1, 2)` должен вернуть массив `new[] {4, 2, 3, 1}`

-  `BubbleSortRange(new[] {5, 4, 3, 2, 1}, 0, 3)` должен вернуть массив `new[] {2, 3, 4, 5, 1}`

### Требования к решению:

1. Измените только код метода `BubbleSortRange`

2. Алгоритм должен сортировать только элементы в диапазоне `[left, right]`

3. Элементы за пределами диапазона должны оставаться на своих местах

4. Учтите обработку некорректных значений `left` и `right`

## Шаблон для решения:

```csharp
using System;

public class Program
{
    public static void BubbleSortRange(int[] array, int left, int right)
    {
        // Ваш код здесь
    }

    // Тестовый метод для проверки
    public static void Main()
    {
        // Тест 1
        int[] array1 = {4, 3, 2, 1};
        BubbleSortRange(array1, 1, 2);
        Console.WriteLine("Тест 1: " + string.Join(", ", array1));
        
        // Тест 2
        int[] array2 = {5, 4, 3, 2, 1};
        BubbleSortRange(array2, 0, 3);
        Console.WriteLine("Тест 2: " + string.Join(", ", array2));
        
        // Тест 3
        int[] array3 = {1, 2, 3, 4, 5};
        BubbleSortRange(array3, 1, 3);
        Console.WriteLine("Тест 3: " + string.Join(", ", array3));
    }
}
```

## Формат ввода

Метод принимает три параметра:

-  `array` - массив целых чисел для сортировки

-  `left` - левая граница диапазона (включительно)

-  `right` - правая граница диапазона (включительно)

## Формат вывода

Метод не возвращает значение, а изменяет исходный массив, сортируя только указанный диапазон.

**Примеры работы:**

```
Вход: array = [4, 3, 2, 1], left = 1, right = 2
Выход: [4, 2, 3, 1]

Вход: array = [5, 4, 3, 2, 1], left = 0, right = 3
Выход: [2, 3, 4, 5, 1]

Вход: array = [1, 2, 3, 4, 5], left = 1, right = 3
Выход: [1, 2, 3, 4, 5]
```

## Примечания

-  Индексы `left` и `right` должны быть в пределах массива

-  Если `left > right`, диапазон считается пустым

-  Если `left` или `right` выходят за границы массива, нужно обработать эту ситуацию

-  Диапазон включает оба конца: `[left, right]`